app/Controllers/ClienteController.php

SELECT *
FROM `clientes`
---
    public function index()
    {
        $model = new ClienteModel();
        $data['clientes'] = $model->findAll();

INSERT INTO `clientes` (`nombre`, `email`, `telefono`, `password`, `id_rol`, `id_departamento`, `id_municipio`) VALUES ('Pedro', 'pedro123@gmail.com', '78945612', '$2y$10$VNTLP/pvpiH/cbSHQZyFE.byEvXx4cj6fCT8vvwMBX3BsydilOisO', 2, '19', 1)
---
    public function guardarInicio()
    {
        $model = new ClienteModel();
        $model->save([
            'nombre' => $this->request->getPost('nombre'),
            'email' => $this->request->getPost('email'),
            'telefono' => $this->request->getPost('telefono'),
            'password' => password_hash($this->request->getPost('password'), PASSWORD_DEFAULT),
            'id_rol' => 2,
            'id_departamento' => $this->request->getPost('departamento'),
            'id_municipio' => 1
        ]);