app/Controllers/Home.php

SELECT *
FROM `departamentos`
---
    public function index(): string
    {
        $departamentoModel = new DepartamentoModel();
        $departamentos = $departamentoModel->findAll();