app/Controllers/ProveedorController.php

    public function index()
    {
        $model = new ProveedorModel();
        $data['proveedores'] = $model->findAll();
---
SELECT *
FROM `proveedores`