app/Controllers/VentaController.php

    public function index()
    {
        $model = new VentaModel();
        $data['ventas'] = $model->findAll();
---
SELECT *
FROM `ventas`