app/Models/ClienteModel.php

    public function verificarCredenciales($email, $password)
    {
        $cliente = $this->where('email', $email)->first();
---
SELECT *
FROM `clientes`
WHERE `email` = 'juan.perez@email.com'
 LIMIT 1